status/2022/0121.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>15 January 2022 - 21 January 2022</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">15 January 2022 - 21 January 2022</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgaa43a7a">1. MIT OCW</a>
<ul>
<li><a href="#org1e6d9ec">1.1. 18.02 - Multiple Variable Calculus</a>
<ul>
<li><a href="#orgaec4849">1.1.1. Sessions 09-13</a></li>
<li><a href="#orgd7a7b02">1.1.2. 3D Plotting in Sagemath.</a></li>
</ul>
</li>
<li><a href="#org47e3866">1.2. 8.01X+8.01L - Physics I - Classical Mechanics with Labs</a>
<ul>
<li><a href="#orgfb70c9e">1.2.1. Started U/P Chapter 5 reading.</a></li>
<li><a href="#org5fe324b">1.2.2. Received materials for 3 Low Voltage Power Supplies</a></li>
<li><a href="#org8562120">1.2.3. Almost ready for experiment ES</a></li>
</ul>
</li>
<li><a href="#org0667660">1.3. 21G.701 Spanish</a>
<ul>
<li><a href="#org3a78f61">1.3.1. Finished Episode 3 'El Comienzo'</a></li>
<li><a href="#org1d44aa2">1.3.2. Received English/Spanish Dictionary</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd38fbed">2. CGR-101</a>
<ul>
<li><a href="#org4cfdc31">2.1. Digital Event capture</a></li>
<li><a href="#org5700092">2.2. PWM generation</a></li>
</ul>
</li>
<li><a href="#org554a5a7">3. Mill Controller #2</a></li>
<li><a href="#org3e8f1d3">4. WWVB Decoder</a></li>
<li><a href="#org1fbeb92">5. Santa Cruz Weather Station</a></li>
<li><a href="#orge67b3bf">6. Marble Computation</a>
<ul>
<li><a href="#org9e9e01b">6.1. Next Steps</a>
<ul>
<li><a href="#orgc7d43db">6.1.1. Continue Reversible Computation Study</a></li>
<li><a href="#orgef37a3c">6.1.2. Prototype Marble inverter</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6a02554">7. ca-r</a>
<ul>
<li><a href="#orgf9b97cc">7.1. Next Step</a></li>
</ul>
</li>
<li><a href="#org05680ac">8. us-index-map</a>
<ul>
<li><a href="#org2784cc2">8.1. error analysis</a></li>
</ul>
</li>
<li><a href="#org2111d13">9. Sun Ultra 10</a>
<ul>
<li><a href="#orgb99d346">9.1. Next steps</a>
<ul>
<li><a href="#org92f325b">9.1.1. Serial debug</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge7d560f">10. Apple iMac G4</a>
<ul>
<li><a href="#org7699c34">10.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org5829ea0">11. Davies Brothel</a>
<ul>
<li><a href="#org44fdf54">11.1. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#org2df9d9b">11.2. Next hearing 4/5/2022.</a></li>
</ul>
</li>
<li><a href="#org806229e">12. Peter Kim</a>
<ul>
<li><a href="#org58941f5">12.1. Broadcom CSG Employee indicted for trade secret theft.</a></li>
<li><a href="#org5920b83">12.2. United States v. Kim (5:21-cr-00438).</a></li>
<li><a href="#org4420005">12.3. Next hearing: 1/31/2022 01:30 PM</a></li>
</ul>
</li>
<li><a href="#org20df2b6">13. Linux Audio</a>
<ul>
<li><a href="#orgeb2a0e6">13.1. pvanal to spectrogram</a>
<ul>
<li><a href="#org3f1225a">13.1.1. Next steps</a></li>
</ul>
</li>
<li><a href="#orgf2ff90c">13.2. CSound programming.</a>
<ul>
<li><a href="#org0dbfbf8">13.2.1. Next Steps</a></li>
</ul>
</li>
<li><a href="#org0c70ea3">13.3. Faust programming</a>
<ul>
<li><a href="#org26ee6e1">13.3.1. Next Steps</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd82e9a0">14. EPICS</a>
<ul>
<li><a href="#orgb8a6f12">14.1. Next steps</a>
<ul>
<li><a href="#orga5f8f10">14.1.1. CGR-101 SCPI interface</a></li>
<li><a href="#org75c697b">14.1.2. u3scpi network port testing</a></li>
<li><a href="#orge776575">14.1.3. initial EPICS interface</a></li>
<li><a href="#org0926ed1">14.1.4. u3scpi analog/digital port reconfiguration.</a></li>
<li><a href="#orgbc671ee">14.1.5. u3scpi 'DIGITIZER' subsystem.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgdd63569">15. Brini Tracker II</a>
<ul>
<li><a href="#orgc529248">15.1. Next steps</a>
<ul>
<li><a href="#org8c547d5">15.1.1. Validate remaining standard GPS messages</a></li>
<li><a href="#orgf18a570">15.1.2. Investigate GPS chipset data logging</a></li>
<li><a href="#org1328dbc">15.1.3. Investigate LoRA radio interface</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3b7b289">16. wktcolor</a>
<ul>
<li><a href="#org39a9e9e">16.1. Next steps</a>
<ul>
<li><a href="#orgcdfab31">16.1.1. Explore how to get a minimal coloring</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org925d626">17. wktplot</a>
<ul>
<li><a href="#orga4f7b32">17.1. Next steps</a></li>
</ul>
</li>
<li><a href="#orgea191f3">18. AMDGPU</a>
<ul>
<li><a href="#org6413cb6">18.1. Next step</a>
<ul>
<li><a href="#org66de966">18.1.1. Reverse engineer HSAKMT programming.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3157429">19. Ninja v Make</a>
<ul>
<li><a href="#org813269b">19.1. Next Step</a>
<ul>
<li><a href="#org10601cf">19.1.1. clean simple measurements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga5b0bdf">20. GMP Forth</a>
<ul>
<li><a href="#org170cb9d">20.1. Need to think about adding floating point support</a></li>
<li><a href="#org819e044">20.2. Port to non-Linux OS</a></li>
</ul>
</li>
<li><a href="#org984c323">21. Swocer</a>
<ul>
<li><a href="#org77b0ae2">21.1. Most crashing addressed</a></li>
<li><a href="#orgd7bb8bc">21.2. Added outline for 'bottle' test</a></li>
<li><a href="#org1c24e6a">21.3. Next steps</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Tongonese Tsunami!
</p>

<div id="outline-container-orgaa43a7a" class="outline-2">
<h2 id="orgaa43a7a"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org1e6d9ec" class="outline-3">
<h3 id="org1e6d9ec"><span class="section-number-3">1.1.</span> 18.02 - Multiple Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgaec4849" class="outline-4">
<h4 id="orgaec4849"><span class="section-number-4">1.1.1.</span> Sessions 09-13</h4>
</div>
<div id="outline-container-orgd7a7b02" class="outline-4">
<h4 id="orgd7a7b02"><span class="section-number-4">1.1.2.</span> 3D Plotting in Sagemath.</h4>
</div>
</div>
<div id="outline-container-org47e3866" class="outline-3">
<h3 id="org47e3866"><span class="section-number-3">1.2.</span> 8.01X+8.01L - Physics I - Classical Mechanics with Labs</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgfb70c9e" class="outline-4">
<h4 id="orgfb70c9e"><span class="section-number-4">1.2.1.</span> Started U/P Chapter 5 reading.</h4>
</div>
<div id="outline-container-org5fe324b" class="outline-4">
<h4 id="org5fe324b"><span class="section-number-4">1.2.2.</span> Received materials for 3 Low Voltage Power Supplies</h4>
</div>
<div id="outline-container-org8562120" class="outline-4">
<h4 id="org8562120"><span class="section-number-4">1.2.3.</span> Almost ready for experiment ES</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Do this two ways (rather than two partners): Analog: as described
in experiment manual with RC circuit (data capture with CGR101).
Digital: CGR101 digital event capture directly.
</p>
</div>
</div>
</div>
<div id="outline-container-org0667660" class="outline-3">
<h3 id="org0667660"><span class="section-number-3">1.3.</span> 21G.701 Spanish</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org3a78f61" class="outline-4">
<h4 id="org3a78f61"><span class="section-number-4">1.3.1.</span> Finished Episode 3 'El Comienzo'</h4>
</div>
<div id="outline-container-org1d44aa2" class="outline-4">
<h4 id="org1d44aa2"><span class="section-number-4">1.3.2.</span> Received English/Spanish Dictionary</h4>
</div>
</div>
</div>
<div id="outline-container-orgd38fbed" class="outline-2">
<h2 id="orgd38fbed"><span class="section-number-2">2.</span> CGR-101</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org4cfdc31" class="outline-3">
<h3 id="org4cfdc31"><span class="section-number-3">2.1.</span> Digital Event capture</h3>
</div>
<div id="outline-container-org5700092" class="outline-3">
<h3 id="org5700092"><span class="section-number-3">2.2.</span> PWM generation</h3>
</div>
</div>
<div id="outline-container-org554a5a7" class="outline-2">
<h2 id="org554a5a7"><span class="section-number-2">3.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-3">
<p>
Simple TCL interface works great - no OpenGL required. Pulled display
controller for debugging.
</p>
</div>
</div>
<div id="outline-container-org3e8f1d3" class="outline-2">
<h2 id="org3e8f1d3"><span class="section-number-2">4.</span> WWVB Decoder</h2>
<div class="outline-text-2" id="text-4">
<p>
Need to re-think.
</p>
</div>
</div>
<div id="outline-container-org1fbeb92" class="outline-2">
<h2 id="org1fbeb92"><span class="section-number-2">5.</span> Santa Cruz Weather Station</h2>
<div class="outline-text-2" id="text-5">
<p>
Application exited due to communications error. Need to consider automatic
restart in this case.
</p>
</div>
</div>
<div id="outline-container-orge67b3bf" class="outline-2">
<h2 id="orge67b3bf"><span class="section-number-2">6.</span> Marble Computation</h2>
<div class="outline-text-2" id="text-6">
<p>
Collected materials (thin copper plate, copper PCB blanks) for prototyping.
</p>
</div>
<div id="outline-container-org9e9e01b" class="outline-3">
<h3 id="org9e9e01b"><span class="section-number-3">6.1.</span> Next Steps</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-orgc7d43db" class="outline-4">
<h4 id="orgc7d43db"><span class="section-number-4">6.1.1.</span> Continue Reversible Computation Study</h4>
</div>
<div id="outline-container-orgef37a3c" class="outline-4">
<h4 id="orgef37a3c"><span class="section-number-4">6.1.2.</span> Prototype Marble inverter</h4>
<div class="outline-text-4" id="text-6-1-2">
<p>
Using dual rail differential logic (left/,right/1), an inverter
merely switches sides. Now thinking an over-center spring controlling
a 'side gate' controlled by a pair of sense levers. Now that there's
a pile of small magnets for physics experiments, maybe something that
uses those?
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org6a02554" class="outline-2">
<h2 id="org6a02554"><span class="section-number-2">7.</span> ca-r</h2>
<div class="outline-text-2" id="text-7">
<p>
Issue #33 seems to have fixed itself.
</p>
</div>
<div id="outline-container-orgf9b97cc" class="outline-3">
<h3 id="orgf9b97cc"><span class="section-number-3">7.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Wait for further breakage.
</p>
</div>
</div>
</div>
<div id="outline-container-org05680ac" class="outline-2">
<h2 id="org05680ac"><span class="section-number-2">8.</span> us-index-map</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org2784cc2" class="outline-3">
<h3 id="org2784cc2"><span class="section-number-3">8.1.</span> error analysis</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Started an error analysis on the USGS topomaps<sub>all.csv</sub> index file. Nothing obvious pops up,
and the error reported by Maureen would be impossible to catch anyway.
</p>
</div>
</div>
</div>
<div id="outline-container-org2111d13" class="outline-2">
<h2 id="org2111d13"><span class="section-number-2">9.</span> Sun Ultra 10</h2>
<div class="outline-text-2" id="text-9">
<p>
Trying to see what state it is in. Fires up but no video. Need DB25M to
debug over serial port.
</p>
</div>
<div id="outline-container-orgb99d346" class="outline-3">
<h3 id="orgb99d346"><span class="section-number-3">9.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-org92f325b" class="outline-4">
<h4 id="org92f325b"><span class="section-number-4">9.1.1.</span> Serial debug</h4>
</div>
</div>
</div>
<div id="outline-container-orge7d560f" class="outline-2">
<h2 id="orge7d560f"><span class="section-number-2">10.</span> Apple iMac G4</h2>
<div class="outline-text-2" id="text-10">
<p>
Building userland may be a PITA due to lack of RAM. Build would often
segfault.
</p>
</div>
<div id="outline-container-org7699c34" class="outline-3">
<h3 id="org7699c34"><span class="section-number-3">10.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Not sure.
</p>
</div>
</div>
</div>

<div id="outline-container-org5829ea0" class="outline-2">
<h2 id="org5829ea0"><span class="section-number-2">11.</span> Davies Brothel</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org44fdf54" class="outline-3">
<h3 id="org44fdf54"><span class="section-number-3">11.1.</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-org2df9d9b" class="outline-3">
<h3 id="org2df9d9b"><span class="section-number-3">11.2.</span> Next hearing 4/5/2022.</h3>
</div>
</div>
<div id="outline-container-org806229e" class="outline-2">
<h2 id="org806229e"><span class="section-number-2">12.</span> Peter Kim</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org58941f5" class="outline-3">
<h3 id="org58941f5"><span class="section-number-3">12.1.</span> Broadcom CSG Employee indicted for trade secret theft.</h3>
</div>
<div id="outline-container-org5920b83" class="outline-3">
<h3 id="org5920b83"><span class="section-number-3">12.2.</span> United States v. Kim (5:21-cr-00438).</h3>
</div>
<div id="outline-container-org4420005" class="outline-3">
<h3 id="org4420005"><span class="section-number-3">12.3.</span> Next hearing: 1/31/2022 01:30 PM</h3>
</div>
</div>
<div id="outline-container-org20df2b6" class="outline-2">
<h2 id="org20df2b6"><span class="section-number-2">13.</span> Linux Audio</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-orgeb2a0e6" class="outline-3">
<h3 id="orgeb2a0e6"><span class="section-number-3">13.1.</span> pvanal to spectrogram</h3>
<div class="outline-text-3" id="text-13-1">
<p>
Enough of libriffr and libpvocf work to start pvoctool
<a href="https://github.com/daniel-kelley/pvoctool">https://github.com/daniel-kelley/pvoctool</a>. Have HDF5 output and
text delimited output for octave. Can import PVOC data to octave
spectrogram for display.
</p>
</div>
<div id="outline-container-org3f1225a" class="outline-4">
<h4 id="org3f1225a"><span class="section-number-4">13.1.1.</span> Next steps</h4>
<div class="outline-text-4" id="text-13-1-1">
<p>
Loop analysis
</p>
</div>
</div>
</div>
<div id="outline-container-orgf2ff90c" class="outline-3">
<h3 id="orgf2ff90c"><span class="section-number-3">13.2.</span> CSound programming.</h3>
<div class="outline-text-3" id="text-13-2">
<p>
The FORTRAN of computer music. Getting up to speed.
</p>
</div>
<div id="outline-container-org0dbfbf8" class="outline-4">
<h4 id="org0dbfbf8"><span class="section-number-4">13.2.1.</span> Next Steps</h4>
<div class="outline-text-4" id="text-13-2-1">
</div>
<ol class="org-ol">
<li><a id="org61fa194"></a>loscil demo<br /></li>
<li><a id="orgf4ee748"></a>spectrogram loop point analysis<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org0c70ea3" class="outline-3">
<h3 id="org0c70ea3"><span class="section-number-3">13.3.</span> Faust programming</h3>
<div class="outline-text-3" id="text-13-3">
</div>
<div id="outline-container-org26ee6e1" class="outline-4">
<h4 id="org26ee6e1"><span class="section-number-4">13.3.1.</span> Next Steps</h4>
<div class="outline-text-4" id="text-13-3-1">
</div>
<ol class="org-ol">
<li><a id="org28fc143"></a>GAC Patch save/restore<br /></li>
<li><a id="orgb5549cd"></a>LV2 autopatcher<br />
<div class="outline-text-5" id="text-13-3-1-2">
<p>
Exploratory tool to generate (was pd, ecasound, now carla) patch for arbitrary LV2 plugin:
hook up audio inputs to signal source, audio outputs to speakers, control inputs to
control surface, etc.
</p>
</div>
</li>
<li><a id="org3995d81"></a>OSC control surface<br />
<div class="outline-text-5" id="text-13-3-1-3">
<p>
Some sort of GUI tool (knob/slider) to OSC messages. This may be
as simple as a Faust UI program.
</p>
</div>
</li>
<li><a id="orgd97b30f"></a>Faust/csound<br />
<div class="outline-text-5" id="text-13-3-1-4">
<p>
See if a faust generated unit works.
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgd82e9a0" class="outline-2">
<h2 id="orgd82e9a0"><span class="section-number-2">14.</span> EPICS</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-orgb8a6f12" class="outline-3">
<h3 id="orgb8a6f12"><span class="section-number-3">14.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-14-1">
</div>
<div id="outline-container-orga5f8f10" class="outline-4">
<h4 id="orga5f8f10"><span class="section-number-4">14.1.1.</span> CGR-101 SCPI interface</h4>
<div class="outline-text-4" id="text-14-1-1">
<p>
See above&#x2026;
</p>
</div>
</div>
<div id="outline-container-org75c697b" class="outline-4">
<h4 id="org75c697b"><span class="section-number-4">14.1.2.</span> u3scpi network port testing</h4>
</div>
<div id="outline-container-orge776575" class="outline-4">
<h4 id="orge776575"><span class="section-number-4">14.1.3.</span> initial EPICS interface</h4>
</div>
<div id="outline-container-org0926ed1" class="outline-4">
<h4 id="org0926ed1"><span class="section-number-4">14.1.4.</span> u3scpi analog/digital port reconfiguration.</h4>
</div>
<div id="outline-container-orgbc671ee" class="outline-4">
<h4 id="orgbc671ee"><span class="section-number-4">14.1.5.</span> u3scpi 'DIGITIZER' subsystem.</h4>
</div>
</div>
</div>

<div id="outline-container-orgdd63569" class="outline-2">
<h2 id="orgdd63569"><span class="section-number-2">15.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-15">
<p>
Maybe this can be simplified to just the GPS module in 'tracking' mode
(which gets carried around), and a separate docking module to extract
the data.
</p>
</div>
<div id="outline-container-orgc529248" class="outline-3">
<h3 id="orgc529248"><span class="section-number-3">15.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-15-1">
</div>
<div id="outline-container-org8c547d5" class="outline-4">
<h4 id="org8c547d5"><span class="section-number-4">15.1.1.</span> Validate remaining standard GPS messages</h4>
</div>
<div id="outline-container-orgf18a570" class="outline-4">
<h4 id="orgf18a570"><span class="section-number-4">15.1.2.</span> Investigate GPS chipset data logging</h4>
</div>
<div id="outline-container-org1328dbc" class="outline-4">
<h4 id="org1328dbc"><span class="section-number-4">15.1.3.</span> Investigate LoRA radio interface</h4>
</div>
</div>
</div>

<div id="outline-container-org3b7b289" class="outline-2">
<h2 id="org3b7b289"><span class="section-number-2">16.</span> wktcolor</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-org39a9e9e" class="outline-3">
<h3 id="org39a9e9e"><span class="section-number-3">16.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-16-1">
</div>
<div id="outline-container-orgcdfab31" class="outline-4">
<h4 id="orgcdfab31"><span class="section-number-4">16.1.1.</span> Explore how to get a minimal coloring</h4>
<div class="outline-text-4" id="text-16-1-1">
<p>
Need a specific planar graph four coloring.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org925d626" class="outline-2">
<h2 id="org925d626"><span class="section-number-2">17.</span> wktplot</h2>
<div class="outline-text-2" id="text-17">
</div>
<div id="outline-container-orga4f7b32" class="outline-3">
<h3 id="orga4f7b32"><span class="section-number-3">17.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-17-1">
<p>
Understand why -r doesn't solve the wktvor/wktdel "sliver at edge" problem.
Explore biological cell Voronoi organization
</p>
</div>
</div>
</div>

<div id="outline-container-orgea191f3" class="outline-2">
<h2 id="orgea191f3"><span class="section-number-2">18.</span> AMDGPU</h2>
<div class="outline-text-2" id="text-18">
</div>
<div id="outline-container-org6413cb6" class="outline-3">
<h3 id="org6413cb6"><span class="section-number-3">18.1.</span> Next step</h3>
<div class="outline-text-3" id="text-18-1">
</div>
<div id="outline-container-org66de966" class="outline-4">
<h4 id="org66de966"><span class="section-number-4">18.1.1.</span> Reverse engineer HSAKMT programming.</h4>
</div>
</div>
</div>

<div id="outline-container-org3157429" class="outline-2">
<h2 id="org3157429"><span class="section-number-2">19.</span> Ninja v Make</h2>
<div class="outline-text-2" id="text-19">
</div>
<div id="outline-container-org813269b" class="outline-3">
<h3 id="org813269b"><span class="section-number-3">19.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-19-1">
</div>
<div id="outline-container-org10601cf" class="outline-4">
<h4 id="org10601cf"><span class="section-number-4">19.1.1.</span> clean simple measurements</h4>
</div>
</div>
</div>

<div id="outline-container-orga5b0bdf" class="outline-2">
<h2 id="orga5b0bdf"><span class="section-number-2">20.</span> GMP Forth</h2>
<div class="outline-text-2" id="text-20">
</div>
<div id="outline-container-org170cb9d" class="outline-3">
<h3 id="org170cb9d"><span class="section-number-3">20.1.</span> Need to think about adding floating point support</h3>
</div>
<div id="outline-container-org819e044" class="outline-3">
<h3 id="org819e044"><span class="section-number-3">20.2.</span> Port to non-Linux OS</h3>
</div>
</div>
<div id="outline-container-org984c323" class="outline-2">
<h2 id="org984c323"><span class="section-number-2">21.</span> Swocer</h2>
<div class="outline-text-2" id="text-21">
<p>
Likely will suspend future efforts in favor of just using C++ directly.
There's not much value in a wrapper that isn't able to leverage Ruby
very much.
</p>
</div>
<div id="outline-container-org77b0ae2" class="outline-3">
<h3 id="org77b0ae2"><span class="section-number-3">21.1.</span> Most crashing addressed</h3>
<div class="outline-text-3" id="text-21-1">
<p>
Nullified 'handle' API free functions helped a lot.
Still see some errors in operations.
</p>
</div>
</div>
<div id="outline-container-orgd7bb8bc" class="outline-3">
<h3 id="orgd7bb8bc"><span class="section-number-3">21.2.</span> Added outline for 'bottle' test</h3>
<div class="outline-text-3" id="text-21-2">
<p>
Added all functions believed to be needed for 'bottle' demo test.
Test doesn't pass so is disabled.
</p>
</div>
</div>
<div id="outline-container-org1c24e6a" class="outline-3">
<h3 id="org1c24e6a"><span class="section-number-3">21.3.</span> Next steps</h3>
<div class="outline-text-3" id="text-21-3">
<p>
Swocer future.
Check out what's needed for gears.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-10-28 Sat 04:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>